#include "../../common.h"

typedef unsigned char byte;
typedef unsigned char undefined;
typedef unsigned char undefined1;
typedef unsigned short undefined2;
typedef unsigned int undefined4;
typedef unsigned int uint;
typedef unsigned short ushort;

#ifndef true
#define true 1
#endif

#ifndef false
#define false 0
#endif

typedef int bool;

typedef struct
{
    s16 unk0;
    s16 unk2;
} M2cUILerp2DLinearArg0;

typedef struct
{
    u8 pad00[0x18];
    s32 unk18;
} MeshInfo;

typedef struct
{
    s32 visLeafList[4];
    s32 visFaceList[4];
    s32 visOVertList[4];
    s32 visSCVertList[4];
    s32 visLeafSrc[4];
    s32 visFaceSrc[4];
    s32 visOVertSrc[4];
    s32 visSCVertSrc[4];
} VisMem;

struct Level
{
    MeshInfo *meshInfo;          // 0x00
    void *skybox;                // 0x04
    s32 unk08;                   // 0x08
    s32 unk0C;                   // 0x0C
    s32 unk10;                   // 0x10
    u8 pad14[0x34 - 0x14];
    s32 unk34;                   // 0x34
    s32 unk38;                   // 0x38
    u8 pad3C[0x44 - 0x3C];
    s32 unk44;                   // 0x44
    u8 skyboxGlow[0xDC - 0x48];  // 0x48
    s32 configFlags;             // 0xDC
    u8 padE0[0x170 - 0xE0];
    s32 unk170;                  // 0x170
    s32 unk174;                  // 0x174
    s32 unk178;                  // 0x178
};

typedef struct
{
    GameTracker *gameTracker;
    GamepadSystem *gamepadSystem;
} OtMemPair;

typedef struct
{
    u8 pad00[0x80];
    void *nextPrim;
} DbPrimCursor;

typedef struct
{
    u32 tag;
    u8 r0;
    u8 g0;
    u8 b0;
    u8 code;
    s16 x0;
    s16 y0;
    s16 x1;
    s16 y1;
    s16 x2;
    s16 y2;
    s16 x3;
    s16 y3;
} PrimPolyF4;

u8 *s_OTMem;
extern u8 *PTR_gamepadSystem_8008d2b0;
extern s32 lngStrings;
extern s16 lngIndex_gamepadUnplugged[];
extern s16 errorMessagePosIndex;
extern s16 errorPosY[];
extern u16 finalLapTextTimer[4];
extern s32 stage;
extern s16 AkuHint_RequestedHint;
extern s16 AkuHint_boolInterruptWarppad;
extern s32 boolDebugDispEnv;
extern s32 boolPlayVideoSTR;
extern s32 vsyncTillFlip;
extern s16 frameCounter;
extern s16 videoSTR_dst_vramX;
extern s16 videoSTR_dst_vramY;
extern s32 videoSTR_src_vramRect;
extern u8 D_8008D2D0[];
extern s32 D_800845A0[];
extern M2C_UNK D_800B4540;
